#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`
<details><summary>Show Plan</summary>
```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/lisuk-dev/plates/runs/run-C52fiGgDgwe1t486

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
data.archive_file.function-zip: Reading...
aws_dynamodb_table.user_workout_templates: Refreshing state... [id=UserWorkoutTemplates]
aws_dynamodb_table.workout_templates: Refreshing state... [id=WorkoutTemplates]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_for_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.dynamodb-lambda-policy will be created
  + resource "aws_iam_role_policy" "dynamodb-lambda-policy" {
      + id     = (known after apply)
      + name   = "dynamodb_lambda_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-east-2:631500494754:table/UserWorkoutTemplates"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-east-2:631500494754:table/WorkoutTemplates"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/servicerole/AWSLambdaBasicExecutionRole"
      + role       = "iam_for_lambda"
    }

  # aws_lambda_function.function will be created
  + resource "aws_lambda_function" "function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "../build/function.zip"
      + function_name                  = "funciton"
      + handler                        = "function"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "go1.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "data.archive_file.function-zip.output_base64sha256"
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 10
      + version                        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
╷
│ Error: Archive creation error
│ 
│   with data.archive_file.function-zip,
│   on lambdas.tf line 1, in data "archive_file" "function-zip":
│    1: data "archive_file" "function-zip" {
│ 
│ error creating archive: error archiving file: could not archive missing
│ file: ../build/function
╵
Operation failed: failed running terraform plan (exit 1)

```
</details>
*Pushed by: @lisukdev, Action: `pull_request`*